Repository: rrpg/world-editor
Catalog: locales/*/LC_MESSAGES/message.po
Languages: fr_fr

# HUMANS_INTERNAL_NAME
source: human
fr_fr: humain

# HUMANS_NAME
source: Humans
fr_fr: Humains

# PLACE_TYPE_DUNGEON
source: Dungeon
fr_fr: Donjon

# GENDER_FEMALE
source: Female
fr_fr: Femme

# GENDER_MALE
source: Male
fr_fr: Homme

# ERROR_NO_START_CELL_SELECTED
source: No start cell selected
fr_fr: Aucune case de départ sélectionnée

# ERROR_NO_SPECIES
source: The world must contain at least one species
fr_fr: Au moins une espèce est requise pour exporter le monde

# ERROR_INVALID_START_CELL_POSITION
source: Invalid start cell position
fr_fr: La case de départ ne peut pas se trouver sur la case sélectionnée

# LOCAL_PROGRESS_DATABASE_CREATION
source: Database creation
fr_fr: Création de la base de données

# LOCAL_PROGRESS_FINISHED
source: Finished
fr_fr: Terminé

# LOCAL_PROGRESS_DATABASE_STRUCTURE_CREATION
source: Database structure creation
fr_fr: Création de la structure de la base de données

# LOCAL_PROGRESS_GENDERS_CREATION
source: Genders creation
fr_fr: Création des sexes

# LOCAL_PROGRESS_SPECIES_CREATION
source: Species creation
fr_fr: Création des espèces

# LOCAL_PROGRESS_REGIONS_CREATION
source: Regions creation
fr_fr: Création des régions

# LOCAL_PROGRESS_AREA_TYPES_CREATION
source: Area types creation
fr_fr: Création des types de zones

# LOCAL_PROGRESS_AREAS_CREATION
source: Areas creation
fr_fr: Création des zones

# LOCAL_PROGRESS_START_CELL
source: Start cell export
fr_fr: Création de la case de départ

# LOCAL_PROGRESS_PLACES
source: Places export
fr_fr: Création des lieux

# LOCAL_PROGRESS_NPC
source: Characters export
fr_fr: Création des personnages

# SIZE_LARGE
source: Large
fr_fr: Grande

# SIZE_MEDIUM
source: Medium
fr_fr: Moyenne

# SIZE_ONE_CELL
source: 1 Cell
fr_fr: Une case

# SIZE_SMALL
source: Small
fr_fr: Petite

# ERROR_OPENING_MAP_FILE
source: An error occured during the opening of the map file
fr_fr: Une erreur est survenue durant l'ouverture de la carte

# ERROR_UNEXISTING_FOLDER
source: The selected folder does not exist
fr_fr: Le dossier sélectionné n'existe pas

# ERROR_NOT_A_FILE
source: The selected path is not a file
fr_fr: Le chemin sélectionné n'est pas un fichier

# EXPORT_MAP_DIALOG_TITLE
source: Map export
fr_fr: Export de la carte

# CREATE_BUTTON
source: Create
fr_fr: Créer

# CANCEL_BUTTON
source: Cancel
fr_fr: Annuler

# NEW_NPC_DIALOG_TITLE
source: Character creation
fr_fr: Création d'un personnage

# NPC_INTERNAL_NAME_LABEL
source: Internal name
fr_fr: Nom interne

# NPC_NAME_LABEL
source: Name
fr_fr: Nom

# NPC_SPECIES_LABEL
source: Species
fr_fr: Espèce

# NPC_GENDER_LABEL
source: Gender
fr_fr: Sexe

# ERROR_EMPTY_NPC_INTERNAL_NAME
source: A character internal name must be provided
fr_fr: Un nom interne est requis

# ERROR_DUPLICATE_NPC_INTERNAL_NAME
source: This internal name is already used
fr_fr: Ce nom interne est déja utilisé

# ERROR_EMPTY_NPC_NAME
source: A character name must be provided
fr_fr: Un nom est requis

# ERROR_INVALID_NPC_SPECIES
source: The selected species is not valid
fr_fr: L'espèce choisie n'est pas valide

# ERROR_INVALID_NPC_GENDER
source: The selected gender is not valid
fr_fr: Le sexe choisi n'est pas valide

# NEW_PLACE_DIALOG_TITLE
source: Place creation
fr_fr: Création d'un lieu

# PLACE_INTERNAL_NAME_LABEL
source: Internal name
fr_fr: Nom interne

# PLACE_NAME_LABEL
source: Name
fr_fr: Nom

# PLACE_SIZE_LABEL
source: Size
fr_fr: Dimensions

# ERROR_EMPTY_PLACE_INTERNAL_NAME
source: A place internal name must be provided
fr_fr: Un nom interne est requis

# ERROR_DUPLICATE_PLACE_INTERNAL_NAME
source: This internal name is already used
fr_fr: Ce nom interne est déja utilisé

# ERROR_EMPTY_PLACE_NAME
source: The place name is mandatory
fr_fr: Un nom de lieu doit être saisi

# DELETE_COLUMN
source: Delete
fr_fr: Supprimer

# DELETE_BUTTON
source: Delete
fr_fr: Supprimer

source: Delete confirmation
fr_fr: Confirmation de suppression

# INTERNAL_NAME_COLUMN
source: Internal name
fr_fr: Nom interne

# LOCATE_COLUMN
source: Locate
fr_fr: Localiser

# NAME_COLUMN
source: Name
fr_fr: Nom

# CONFIRMATION_DELETE_NPC
source: Do you really want to delete this character?
fr_fr: Voulez-vous vraiment supprimer ce personnage ?

# LOCATE_BUTTON
source: Locate
fr_fr: Localiser

# CONFIRMATION_DELETE_PLACE
source: Do you really want to delete this place?
fr_fr: Voulez-vous vraiment supprimer ce lieu ?

# CONFIRMATION_DELETE_SPECIES
source: Do you really want to delete this species?
fr_fr: Voulez-vous vraiment supprimer cette espèce ?

# PLACES_TAB
source: Places
fr_fr: Lieux

# NPC_TAB
source: NPC
fr_fr: Personnages

# MAIN_WINDOW_TITLE
source: rRpg World editor
fr_fr: rRpg - Éditeur de mondes

# ERROR_BOX_TITLE
source: An error occured
fr_fr: Une erreur est survenue

# OPEN_FILE_DIALOG_TITLE
source: Open map
fr_fr: Ouverture d'une carte

# MAP_FILE_TYPE %s
source: Map files %s
fr_fr: Cartes %s

# SAVE_FILE_DIALOG_TITLE
source: Save map
fr_fr: Sauvegarde de la carte

# SET_AS_DEFAULT_QUESTION
source: Set map as default
fr_fr: Carte par défaut

# ERROR_EXPORT_NEEDED
source: The map is not yet exported. Export it now?
fr_fr: La carte n'est pas encore exportée. L'exporter maintenant ?

# YES_BUTTON
source: Yes
fr_fr: Oui

# RECORDING_START_CELL_MESSAGE
source: Select the starting cell
fr_fr: Veuillez sélectionner la case de départ

# RECORDING_PLACE_MESSAGE
source: Select a cell to add a place
fr_fr: Veuillez sélectionner une case pour créer un lieu

# RECORDING_NPC_MESSAGE
source: Select a cell to add a character
fr_fr: Veuillez sélectionner une case pour ajouter un personnage

source: Image viewer
fr_fr: Visionneuse d'image

# ERROR_OPEN_%s
source: An error occured while opening the file %s
fr_fr: Une erreur est survenue durant l'ouverture du fichier %s

# ERROR_PLACE_IN_WATER
source: No place can be added in water
fr_fr: Un lieu ne peut pas être placé dans l'eau

# ERROR_NPC_IN_WATER
source: No character can be added in water
fr_fr: Un personnage ne peut pas être ajouté dans l'eau

source: Unsaved changes
fr_fr: Modifications non enregistrées

# CLOSE_WITH_UNSAVED_CHANGES
source: The current map is not saved, do you really want to quit?
fr_fr: La carte en cours n'est pas enregistrée. Voulez-vous malgré tout quitter ?

# SAVE_BUTTON
source: Save
fr_fr: Enregistrer

# DISCARD_BUTTON
source: Do not save
fr_fr: Ne pas enregistrer

# CREATE_MAP_MENU_ITEM
source: &New...
fr_fr: &Nouvelle carte...

# CREATE_MAP_MENU_ITEM_TIP
source: Create new map
fr_fr: Créer une nouvelle carte

# SAVE_MAP_MENU_ITEM
source: &Save
fr_fr: &Enregistrer

# SAVE_MAP_MENU_ITEM_TIP
source: Save the map
fr_fr: Enregistrer la carte courante

# SAVE_MAP_AS_MENU_ITEM
source: S&ave as...
fr_fr: Enregistrer &sous...

# SAVE_MAP_AS_MENU_ITEM_TIP
source: Save the map as...
fr_fr: Enregistrer la carte courante dans un nouveau fichier

# OPEN_MAP_MENU_ITEM
source: &Open...
fr_fr: &Ouvrir...

# OPEN_MAP_MENU_ITEM_TIP
source: Open a map
fr_fr: Ouvrir une carte existante

# EXPORT_MAP_MENU_ITEM
source: &Export
fr_fr: E&xporter

# EXPORT_MAP_MENU_ITEM_TIP
source: Export the map
fr_fr: Exporter la carte courante

# EXIT_APPLICATION_MENU_ITEM
source: E&xit
fr_fr: &Quitter

# EXIT_APPLICATION_MENU_ITEM_TIP
source: Exit the editor
fr_fr: Quitter l'éditeur

# ZOOM_IN_MENU_ITEM
source: Zoom &in
fr_fr: Zoom a&vant

# ZOOM_IN_MENU_ITEM_TIP
source: Zoom in
fr_fr: Zoomer la carte

# ZOOM_OUT_MENU_ITEM
source: Zoom &out
fr_fr: Zoom a&rrière

# ZOOM_OUT_MENU_ITEM_TIP
source: Zoom out
fr_fr: Dézoomer la carte

# SELECT_START_CELL_MENU_ITEM
source: Select &start cell
fr_fr: Sélectionner la case de &départ

# SELECT_START_CELL_MENU_ITEM_TIP
source: Select the map start cell
fr_fr: Sélectionner la case de départ

# ADD_PLACE_MENU_ITEM
source: Add a &place
fr_fr: Ajouter un &lieu

# ADD_PLACE_MENU_ITEM_TIP
source: Add a place in the map
fr_fr: Ajouter un lieu sur la carte

# ADD_NPC_MENU_ITEM
source: Add a &character
fr_fr: Ajouter un &personnage

# ADD_NPC_MENU_ITEM_TIP
source: Add a character in the map
fr_fr: Ajouter un personnage sur la carte

# LIST_SPECIES_MENU_ITEM
source: &List species
fr_fr: Liste des espèces...

# LIST_SPECIES_MENU_ITEM_TIP
source: List the world species
fr_fr: Lister les espèces existantes

# SET_AS_DEFAULT_MENU_ITEM
source: Set as default map
fr_fr: Définir comme carte par défaut

# SET_AS_DEFAULT_ITEM_TIP
source: Set this map as default map for the game. If the game is launched without specified map, this one will be used
fr_fr: Défini la carte comme carte par défaut pour le jeu. Si aucune carte n'est spécifié au lancement du jeu, celle ci sera utilisée

# FILE_MENU
source: &File
fr_fr: &Fichier

# MAP_MENU
source: &Map
fr_fr: &Carte

# WORLD_MENU
source: &World
fr_fr: &Monde

# NEW_MAP_DIALOG_TITLE
source: Create a map
fr_fr: Nouvelle carte

# MAP_NAME_LABEL
source: Name
fr_fr: Nom

# MAP_WIDTH_LABEL
source: Width
fr_fr: Largeur

# MAP_HEIGHT_LABEL
source: Height
fr_fr: Hauteur

# ERROR_INVALID_WIDTH_HEIGHT_VALUE
source: Positive number expected for the width and the height
fr_fr: La hauteur et la largeur doivent être des entiers positifs

# ERROR_EMPTY_MAP_NAME
source: A world name must be provided
fr_fr: Un nom est requis

# LOADING_GENERATION_TEXT
source: Generating...
fr_fr: Génération...

# LIST_SPECIES_DIALOG_TITLE
source: World species
fr_fr: Espèces

# CLOSE_BUTTON
source: Close
fr_fr: Fermer

# SPECIES_NAME_LABEL
source: Name
fr_fr: Nom

# SPECIES_INTERNAL_NAME_LABEL
source: Internal name
fr_fr: Nom interne

# ERROR_ALREADY_EXISTING_SPECIES
source: A species already exists with this internal name
fr_fr: Ce nom interne est déja utilisé
